#include "skse64/PluginAPI.h"
#include "skse64/PapyrusArgs.h"
#include "skse64/PapyrusNativeFunctions.h"
#include "skse64/ScaleformCallbacks.h"
#include "skse64/ScaleformMovie.h"
#include "skse64_common/BranchTrampoline.h"
#include "skse64_common/SafeWrite.h"
#include "skse64/GameForms.h"
#include "skse64/GameReferences.h"
#include "skse64/GameCamera.h"
#include "skse64/GameMenus.h"
#include "skse64/GameThreads.h"
#include "skse64/NiNodes.h"
#include "skse64/NiObjects.h"
#include "xbyak/xbyak.h"
#include <shlobj.h>				// CSIDL_MYCODUMENTS
#include <stdlib.h>

#define _USE_MATH_DEFINES 1
#include <math.h>

#include "PatchUtils.h"

//#define RUNTIME_VERSION		0x01050270  // No More Runtime version, now it is universal dll

//#define LOGME	

#ifndef LOGME
#define _MESSAGE
#endif

// SKSE class with some types corrections
class ThirdPersonState_ : public TESCameraState
{
public:
	ThirdPersonState_();
	virtual ~ThirdPersonState_();
	virtual void Unk_09(void);
	virtual void Unk_0A(void);
	virtual void UpdateMode(bool weaponDrawn);

	PlayerInputHandler		inputHandler;				// 20
	NiNode					* cameraNode;				// 30
	NiNode					* controllerNode;			// 38
	float					unk40[4];					// 40
	UInt32					unk50[3];					// 50
	float					fOverShoulderPosX;			// 5C
	float					fOverShoulderCombatAddY;	// 60
	float					fOverShoulderPosZ;			// 64
	float					unk68[3];					// 68
	float					unk74[6];					// 74  // This would be 54 in Skyrim32
	float					unk8C;						// 8C - init'd 7F7FFFFF   This is 6C in Skyrim32
	UInt32					unk90[3];					// 90
	float					unk9C;						// 9C - init'd 7F7FFFFF
	UInt64					unkA0;						// A0
	UInt64					unkA8;						// A8
	float					unkB0;						// B0
	UInt32					unkB4[3];					// B4
	float					unkC0[6];					// C0     C0[5] = AC in Skyrim32
	float					unkD8;						// D8    B0 in Skyrim32
	UInt8					unkDC[7];					// DC 
	UInt8					padE3[5];					// E3
};
STATIC_ASSERT(sizeof(ThirdPersonState_) == 0xE8);
STATIC_ASSERT(offsetof(ThirdPersonState_, unk74) == 0x74);
STATIC_ASSERT(offsetof(ThirdPersonState_, unkC0) == 0xC0);

class FurnitureCameraState_ : public TESCameraState
{
public:
	FurnitureCameraState_();
	virtual ~FurnitureCameraState_();

	float	unk20;	// 20
	float	unk24;	// 24
	float	unk28;	// 28
	float	unk2C;	// 2C
	UInt32	unk30;	// 30
	UInt32	unk34;	// 34
	UInt32	unk38;	// 38
	UInt8	unk3C;	// 3C
	UInt8	unk3D;	// 3D
	UInt8	unk3E;	// 3E
	UInt8	pad3F;	// 3F
};
STATIC_ASSERT(offsetof(FurnitureCameraState_, unk20) == 0x20);

class MovementControllerNPC
{
public:

	virtual ~MovementControllerNPC();

	// void *vtbl  - 00
	UInt8 unk008[0x1C0 - 8]; 
	bool unk1C0; // E4 in Skyrim32

	// ... More shit here
};
STATIC_ASSERT(offsetof(MovementControllerNPC, unk1C0) == 0x1C0);

struct RefEntry
{
	UInt32 id;
	BSHandleRefObject *handleRef;
};
STATIC_ASSERT(sizeof(RefEntry) == 0x10);

enum Transformation
{
	TRANSFORM_NONE,
	TRANSFORM_WEREWOLF,
	TRANSFORM_VAMPIRELORD
};

IDebugLog	gLog;

BOOL bEnableFirstPersonBody;
BOOL bEnableFirstPersonBodyConsole;
BOOL bEnableHeadBobPosition;
BOOL bEnableHeadBobPositionSprint;
BOOL bEnableHeadBobPositionCombat;
BOOL bEnableHeadBobPositionBow;
BOOL bEnableHeadBobPositionBowAim;
BOOL bEnableHeadBobPositionCombatSprint;
BOOL bEnableHeadBobPositionSneak;
BOOL bEnableHeadBobPositionSneakCombat;
BOOL bEnableHeadBobPositionSneakBow;
BOOL bEnableHeadBobPositionSneakBowAim;
